In [1]:
import pandas as pd
import numpy as np

In [9]:
dict1={
    "name":["asif","kashif","saqib","sabir","tayyab"],
    "marks":[32,32,23,22,43],
    "city":["fsd","rwd","layyah","samundri","lahore"],
}

In [10]:
df=pd.DataFrame(dict1)

In [11]:
df

     name  marks      city
0    asif     32       fsd
1  kashif     32       rwd
2   saqib     23    layyah
3   sabir     22  samundri
4  tayyab     43    lahore

In [13]:
df.to_csv('index.csv')

In [16]:
df.to_csv('index_false.csv',index=False)

In [17]:
df.head(2)

     name  marks city
0    asif     32  fsd
1  kashif     32  rwd

In [18]:
 df.tail(2)

     name  marks      city
3   sabir     22  samundri
4  tayyab     43    lahore

In [19]:
df.describe()

           marks
count   5.000000
mean   30.400000
std     8.502941
min    22.000000
25%    23.000000
50%    32.000000
75%    32.000000
max    43.000000

In [20]:
asif=pd.read_csv('index.csv')

In [21]:
asif

   Unnamed: 0    name  marks      city
0           0    asif     32       fsd
1           1  kashif     32       rwd
2           2   saqib     23    layyah
3           3   sabir     22  samundri
4           4  tayyab     43    lahore

In [25]:
asif["marks"][1]=438739

C:\Users\User\AppData\Local\Temp\ipykernel_10160\3092866091.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  asif["marks"][1]=438739

In [26]:
asif["marks"][1]

438739

In [29]:
asif.to_csv('asiff.csv')

In [30]:
asif.index=["asif","kashif","saqib","sabir","tayyab"]

In [31]:
asif

        Unnamed: 0    name   marks      city
asif             0    asif      32       fsd
kashif           1  kashif  438739       rwd
saqib            2   saqib      23    layyah
sabir            3   sabir      22  samundri
tayyab           4  tayyab      43    lahore

In [ ]:
ser=pd.Series(np.random.rand(32))